{
  "backend/main.mo": "Motoko canister managing user profiles, leadership word submissions, activity submissions, and access control with maps and lists.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files.",
  "frontend/index.css": "Tailwind CSS config defining theme variables, light/dark modes, and base styles.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and QueryClient provider.",
  "frontend/src/components/AppShell.tsx": "Layout shell with navigation, authentication controls, and mobile menu handling.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "Component fetching and displaying top leadership words in a bar-chart-style list.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "Displays community micro‑solutions with loading and empty states, mapping challenge types to labels and rendering solution cards.",
  "frontend/src/components/PageSection.tsx": "Wrapper component that renders a styled responsive section container for layout.",
  "frontend/src/components/SignInGate.tsx": "Gates child content behind Internet Identity authentication, showing a sign‑in prompt when unauthenticated.",
  "frontend/src/content/movieReferences.ts": "Exports a list of movie reference strings used for quotes and citations.",
  "frontend/src/content/proposalContent.ts": "Provides structured proposal metadata and text fields including title, author info, abstracts, and learning outcomes.",
  "frontend/src/content/references.ts": "Defines an ordered list of academic references with stable keys for display and citation use.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, exposing identity state, login, and logout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting leadership word data, micro‑solutions, and activity quotes via the actor API with error handling and cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines light and dark theme CSS variables for colors, borders, and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context providers before rendering App.",
  "frontend/src/pages/ActivitiesPage.tsx": "Displays an overview of Activities 1 and 2 with descriptions and links to start each activity.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements Activity 1, allowing users to submit leadership word reflections and fetch affirmation quotes with validation and error handling.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2, enabling submission of resilient leadership scenarios, validation of heroic responses, and retrieval of supportive quotes.",
  "frontend/src/pages/BioPage.tsx": "Renders the author's bio, background, and social links using proposal content and styled components.",
  "frontend/src/pages/LeadershipBoardPage.tsx": "Shows community leadership word patterns and shared micro‑solutions in a two‑column dashboard layout.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Renders a page showing learning outcomes from proposalContent with styled cards.",
  "frontend/src/pages/MovieReferencesPage.tsx": "Displays a list of movie references from movieReferences with simple styled containers.",
  "frontend/src/pages/OverviewPage.tsx": "Shows a hero banner, abstract content, and quick links using proposalContent data.",
  "frontend/src/pages/ReferencesPage.tsx": "Lists academic references from REFERENCES in styled cards.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Placeholder page that renders null.",
  "frontend/src/pages/SlidesPage.tsx": "Placeholder page that renders null.",
  "frontend/src/pages/TakeawaysPage.tsx": "Displays key takeaways from proposalContent with icons and styled sections.",
  "frontend/src/utils/activity1Affirmations.ts": "Generates affirmation text based on leadership inputs using templates tied to leadership themes.",
  "frontend/src/utils/activity2Validation.ts": "Detects themes in user input, selects a citation, and generates a validation message.",
  "frontend/src/utils/challengeTypeMapping.ts": "Maps UI challenge type string keys to backend ChallengeType enum variants.",
  "frontend/src/utils/isVillainousInput.ts": "Checks text for negative or harmful language using keyword and phrase matching.",
  "frontend/src/utils/quoteFormatting.ts": "Converts backend QuoteGenre enum values into readable franchise names.",
  "frontend/src/utils/starWarsQuotes.ts": "Contains a curated list of Star Wars quotes and returns one deterministically by seed.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash), persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into readable user messages, handling initialization, validation, network, backend, and generic failures.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Defines project state, requirements, and planned features for blocking negative responses with error code 000 and adding a Leadership Board tab."
}