{
  "backend/main.mo": "Motoko canister defining the backend actor that stores leadership word submissions, counts aggregated words, and collects resilient leadership activities with query APIs for summaries and listings.",
  "feature_evidence.json": "Machine-readable report mapping implemented product features to frontend files, shared components, test requirements, and confidence levels for the Institution Hero app.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files, documenting routing, pages, components, hooks, styling, and configuration for build and review purposes.",
  "frontend/index.css": "Global Tailwind CSS base layer defining light and dark theme design tokens (colors, radius, charts, sidebar) and applying consistent background, text, and border styles.",
  "frontend/index.html": "Minimal HTML entry point that sets metadata, page title, root mount element, and loads the React application entry script.",
  "frontend/src/App.tsx": "Main React application entry configuring TanStack Router routes, wrapping all pages in a shared AppShell layout and ThemeProvider.",
  "frontend/src/components/AppShell.tsx": "Shared application layout with sticky header, navigation links, responsive mobile menu, branding, and Internet Identity–based authentication controls.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "UI component that fetches aggregated leadership word counts and displays the top results as a ranked bar chart with loading and empty states.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "React component that fetches and displays community-submitted micro-solutions grouped by challenge type, with loading and empty states. It renders a scrollable list showing the challenge label, solution text, and associated protective factor.",
  "frontend/src/components/PageSection.tsx": "Layout wrapper component that renders children inside a responsive, centered section with consistent padding and max width. Accepts an optional className for customization.",
  "frontend/src/components/SignInGate.tsx": "Authentication guard component that blocks access to children unless the user is signed in via Internet Identity. Shows a sign-in prompt with status handling when unauthenticated.",
  "frontend/src/content/proposalContent.ts": "Static content module containing proposal metadata, author bio, abstracts, learning outcomes, and activity descriptions for the application. Used to populate pages and activities with research-based text.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity using React Query. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags. Wraps the app to expose identity state to all components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as leadership word counts and micro-solutions. All queries depend on the authenticated actor and handle cache invalidation on mutation success.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining light and dark theme color variables, typography, and base styles. Establishes the design system for backgrounds, cards, accents, and charts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app and wraps it with React Query and Internet Identity providers. Initializes global state management and authentication context.",
  "frontend/src/pages/ActivitiesPage.tsx": "Page component that introduces and links to two interactive leadership activities using proposal content. Displays activity goals and descriptions with navigation to the respective activity routes.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Renders Activity 1 where signed-in users submit a single leadership word with reflections, validates input, submits via a mutation, and shows a thank-you state with community pattern summary.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2 allowing users to submit a resilient leadership micro-solution tied to campus challenges, posts it via a mutation, and displays a community solutions list after submission.",
  "frontend/src/pages/BioPage.tsx": "Displays an author bio page using proposal content, including name, organization, biography text, and a brief international experience section.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Shows a list of learning outcomes pulled from proposal content, presented as styled cards within a shared page layout.",
  "frontend/src/pages/OverviewPage.tsx": "Provides a landing overview with hero banner, abstract content, and navigation links to activities, learning outcomes, and the session outline.",
  "frontend/src/pages/ReferencesPage.tsx": "Renders a references page listing research sources from proposal content in a simple card-based layout.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Displays the session timeline with total duration calculation, individual agenda items, and facilitation notes sourced from proposal content.",
  "frontend/src/pages/TakeawaysPage.tsx": "Presents key takeaways from the session, mapping proposal content into styled sections with titles and descriptions.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, custom theme extensions (colors, fonts, radii, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the overall project state and roadmap for the “Institution Hero” app, including schema/versioning, a high-level summary, and a list of planned features. Captures requirements for core content pages, interactive leadership activities, authentication, session outline views, and visual theming based on the provided higher-education proposal."
}