{
  "backend/main.mo": "Motoko canister handling user profiles, leadership word submissions with counts, and resilient leadership activity storage using access control.",
  "feature_evidence.json": "Feature evidence report listing two UI features, their components, linked files, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing the purpose of each frontend component and page.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining light and dark theme palettes.",
  "frontend/index.html": "HTML entry point providing root container and loading the main React script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and React Query provider.",
  "frontend/src/components/AppShell.tsx": "Application shell with header navigation, auth controls, responsive mobile menu, and routed content outlet.",
  "frontend/src/components/HeroBanner.tsx": "Reusable hero banner displaying a background image with title and optional subtitle overlay.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "Component fetching and displaying top leadership word counts with optional polling and bar visualization.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "Displays a list of community micro‑solutions with optional polling and loading/empty states.",
  "frontend/src/components/PageSection.tsx": "Wrapper component that renders children inside a styled, responsive page section.",
  "frontend/src/components/SignInGate.tsx": "Gates content behind Internet Identity authentication and shows a sign‑in prompt when unauthenticated.",
  "frontend/src/content/movieReferences.ts": "Exports a list of movie and film‑series citation strings used in activities and the references page.",
  "frontend/src/content/proposalContent.ts": "Provides structured text content for a proposal, including metadata, bios, abstracts, and learning outcomes.",
  "frontend/src/content/references.ts": "Defines a typed list of academic reference entries used across the app for consistent citation access.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting leadership words and resilient leadership activities with optimistic updates.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivitiesPage.tsx": "Renders a landing page listing two activities with descriptions and navigation links.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements Activity 1 form flow for submitting leadership words and generating affirmations with backend quotes.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2 submission flow for resilient leadership challenges and generating validation with backend quotes.",
  "frontend/src/pages/BioPage.tsx": "Displays author biography, organization info, and links to social profiles and experiences.",
  "frontend/src/pages/LeadershipBoardPage.tsx": "Shows community leadership word patterns and micro‑solutions with live polling.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Renders a page showing learning outcomes using content from proposalContent with styled sections and icons.",
  "frontend/src/pages/MovieReferencesPage.tsx": "Displays a list of movie references with descriptions, pulling data from movieReferences.",
  "frontend/src/pages/OverviewPage.tsx": "Shows the abstract and full abstract from proposalContent and provides quick navigation links to activities and learning outcomes.",
  "frontend/src/pages/ReferencesPage.tsx": "Lists academic references from REFERENCES in styled cards.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SlidesPage.tsx": "Provides access to session slides with a displayed QR code.",
  "frontend/src/pages/TakeawaysPage.tsx": "Displays key takeaways from proposalContent with icons and descriptions.",
  "frontend/src/utils/activity1Affirmations.ts": "Generates affirmation messages and selects academic references based on leadership-related inputs.",
  "frontend/src/utils/activity2Validation.ts": "Detects themes in user inputs, selects a matching reference, and builds validation messages for activity 2.",
  "frontend/src/utils/challengeTypeMapping.ts": "Maps UI challenge type keys to backend ChallengeType enum variants.",
  "frontend/src/utils/isVillainousInput.ts": "Checks text for negative or harmful keywords to flag villainous input.",
  "frontend/src/utils/quoteFormatting.ts": "Converts backend QuoteGenre enum values into user-facing franchise labels.",
  "frontend/src/utils/referenceSelection.ts": "Validates reference entries and selects valid references deterministically or randomly based on input.",
  "frontend/src/utils/starWarsQuotes.ts": "Defines a StarWarsQuote interface, a list of curated Star Wars quotes, and a deterministic quote selector.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/userFacingError.ts": "Maps unknown or technical error values into user-friendly English messages with specific handling for common backend and network errors.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes current project state, features, and requirements related to adding a moat-and-trees footer graphic across tab pages."
}