{
  "backend/main.mo": "Motoko canister implementing user profiles, leadership word submissions, activity submissions, and access‑controlled data storage using Maps and Lists.",
  "feature_evidence.json": "Feature evidence report listing a single bio‑page update requirement and the related frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and recent updates.",
  "frontend/index.css": "Tailwind base and custom CSS variables defining light/dark theme colors and global styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "React root setup configuring TanStack Router routes and React Query provider for all pages.",
  "frontend/src/components/AppShell.tsx": "Application shell with navigation, authentication controls, and responsive header layout.",
  "frontend/src/components/HeroBanner.tsx": "Reusable hero banner component rendering a background image with title and optional subtitle.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "Component fetching and displaying leadership word counts with optional polling and bar visualization.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "Fetches and displays community micro‑solutions with optional polling, handling loading and empty states.",
  "frontend/src/components/PageSection.tsx": "A layout wrapper that renders children inside a styled, centered page section.",
  "frontend/src/components/SignInGate.tsx": "Blocks access to content unless the user is authenticated, showing a sign‑in prompt when needed.",
  "frontend/src/content/movieReferences.ts": "Exports a list of movie and film‑series citation strings used in activities and reference pages.",
  "frontend/src/content/proposalContent.ts": "Provides structured text content for a proposal, including title, abstracts, bio, and outcomes.",
  "frontend/src/content/references.ts": "Defines and exports the complete ordered list of academic references with stable keys.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider using Internet Identity, exposing identity and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and submitting leadership words and micro‑solutions, including optimistic cache updates.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity providers, and renders the app.",
  "frontend/src/pages/ActivitiesPage.tsx": "Displays an overview of the two activities with descriptions and navigation links.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements Activity 1 form handling, submission, validation, and affirmation/quote retrieval.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2 form handling, submission, validation, and inspirational quote retrieval.",
  "frontend/src/pages/BioPage.tsx": "Renders author bio, background details, and external profile links.",
  "frontend/src/pages/LeadershipBoardPage.tsx": "Shows community leadership word patterns and micro‑solutions with live polling.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Renders a page showing learning outcomes pulled from proposalContent, displayed in styled cards with icons.",
  "frontend/src/pages/MovieReferencesPage.tsx": "Displays a list of movie references from movieReferences with styled cards under a hero banner.",
  "frontend/src/pages/OverviewPage.tsx": "Shows the abstract and full abstract from proposalContent along with links to activities and learning outcomes.",
  "frontend/src/pages/ReferencesPage.tsx": "Lists academic references from REFERENCES in styled blocks under a hero banner.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/SlidesPage.tsx": "Provides access to presentation slides via an image QR code within a styled section.",
  "frontend/src/pages/TakeawaysPage.tsx": "Displays key takeaways from proposalContent in styled cards with icons.",
  "frontend/src/utils/activity1Affirmations.ts": "Generates leadership affirmation messages and selects a matching academic reference based on user inputs.",
  "frontend/src/utils/activity2Validation.ts": "Detects themes in user responses, generates validation messages, and selects appropriate references based on keywords.",
  "frontend/src/utils/challengeTypeMapping.ts": "Maps UI challenge type string keys to backend ChallengeType enum values.",
  "frontend/src/utils/isVillainousInput.ts": "Checks text for negative or harmful keywords or phrases to flag villainous input.",
  "frontend/src/utils/quoteFormatting.ts": "Maps backend QuoteGenre enum values to human-readable franchise names.",
  "frontend/src/utils/referenceSelection.ts": "Validates reference formats and provides deterministic or fallback selection of valid references.",
  "frontend/src/utils/starWarsQuotes.ts": "Defines a StarWarsQuote interface, a list of curated Star Wars quotes, and a deterministic quote selector based on a numeric seed.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, retrieve, and clear URL and session parameters, including support for hash-based routing.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into user-friendly messages, handling initialization, validation, network, and generic errors.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including schema version, feature states, issues, and pending feature requests."
}