{
  "backend/main.mo": "Motoko canister defining user profiles, leadership word submissions, activity submissions, and access control–protected query and update methods.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short human-written descriptions of their functionality.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and base style resets.",
  "frontend/index.html": "Base HTML document with a root div and script loading the React entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and React Query client, rendering the app within AppShell.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, navigation, auth handling, and mobile menu support.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "Component displaying top leadership words with optional polling via React Query.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "Displays a list of community micro‑solutions with optional polling and handles loading and empty states.",
  "frontend/src/components/PageSection.tsx": "Provides a styled section wrapper with configurable class names for page layout.",
  "frontend/src/components/SignInGate.tsx": "Shows a sign‑in prompt using Internet Identity when the user is not authenticated and otherwise renders children.",
  "frontend/src/content/movieReferences.ts": "Exports an array of movie and film‑series reference strings used for citations.",
  "frontend/src/content/proposalContent.ts": "Defines structured proposal metadata, including title, author, bio, abstracts, and learning outcomes.",
  "frontend/src/content/references.ts": "Exports a typed list of academic reference entries with stable keys for citation use.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, providing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and submitting leadership words and resilient leadership activities, including optimistic updates and polling options.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivitiesPage.tsx": "Displays an overview of two interactive activities with descriptions and navigation links.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements the UI and logic for submitting a leadership word, generating affirmations, and fetching related quotes.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Handles resilient leadership activity submissions, validation generation, and quote retrieval.",
  "frontend/src/pages/BioPage.tsx": "Shows the author's bio, organization details, and social links.",
  "frontend/src/pages/LeadershipBoardPage.tsx": "Displays community leadership word trends and shared micro‑solutions with live polling.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Renders a page showing learning outcomes pulled from proposalContent, displayed in styled cards.",
  "frontend/src/pages/MovieReferencesPage.tsx": "Displays a list of inspirational movie references from movieReferences with simple styled cards.",
  "frontend/src/pages/OverviewPage.tsx": "Provides a hero banner, abstract sections, and quick navigation links using proposalContent data.",
  "frontend/src/pages/ReferencesPage.tsx": "Shows academic references from REFERENCES in a styled list layout.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SlidesPage.tsx": "Placeholder page that renders nothing.",
  "frontend/src/pages/TakeawaysPage.tsx": "Displays key takeaways from proposalContent with titles and descriptions in styled sections.",
  "frontend/src/utils/activity1Affirmations.ts": "Generates affirmation messages and selects academic references based on leadership-related user inputs.",
  "frontend/src/utils/activity2Validation.ts": "Detects themes from user text, generates validation messages, and selects references accordingly.",
  "frontend/src/utils/challengeTypeMapping.ts": "Maps UI challenge type keys to backend ChallengeType enum values.",
  "frontend/src/utils/isVillainousInput.ts": "Detects negative or harmful language using keyword and phrase matching utilities.",
  "frontend/src/utils/quoteFormatting.ts": "Converts backend QuoteGenre enum values to readable franchise names.",
  "frontend/src/utils/referenceSelection.ts": "Validates references and selects deterministically or randomly from valid academic references.",
  "frontend/src/utils/starWarsQuotes.ts": "Provides a typed list of Star Wars quotes and a deterministic selector function based on a numeric seed.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/src/utils/userFacingError.ts": "Converts unknown or technical errors into friendly user-facing messages with special handling for common cases.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, containers, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, including versions, requirements, existing features, and pending requests."
}