{
  "backend/main.mo": "Motoko canister defining data models and endpoints for leadership word submissions, resilient leadership activities, and per-user cycling quotes for two activities, with persistent storage and basic validation.",
  "feature_evidence.json": "Structured report documenting three frontend features related to fetching per-user quotes from the canister, including affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files, covering routing, pages, components, hooks, styles, and recent feature updates.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, chart colors, and base element styles.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Application bootstrap configuring TanStack Router routes, wrapping all pages in AppShell and ThemeProvider.",
  "frontend/src/components/AppShell.tsx": "Shared layout component providing header navigation, authentication controls with Internet Identity, responsive mobile menu, and footer wrapper for all pages.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "UI component that fetches and visualizes aggregated leadership word counts as a top-10 horizontal bar chart with loading and empty states.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "React component that fetches and displays community-submitted micro-solutions, handling loading and empty states and mapping challenge types to readable labels.",
  "frontend/src/components/PageSection.tsx": "Simple layout wrapper component that renders children inside a responsive, centered section with consistent padding and max width.",
  "frontend/src/components/SignInGate.tsx": "Authentication gate component that requires Internet Identity login before rendering children, otherwise showing a sign-in prompt and button.",
  "frontend/src/content/proposalContent.ts": "Static content module exporting proposal metadata, author bio, abstracts, and learning outcomes for the Institution Hero presentation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity authentication state, login/logout actions, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as leadership words, micro-solutions, activities, and quotes via the actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, light/dark color palettes, and base typography and layout styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers.",
  "frontend/src/pages/ActivitiesPage.tsx": "Renders an overview page listing two interactive activities, pulling titles/goals/descriptions from proposalContent and linking to their respective routes.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements Activity 1 where signed-in users submit a single leadership word with reflections, then receive a generated affirmation and a fetched inspirational quote.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2 where users submit a resilience challenge, responses, and a micro-solution, with validation feedback, quotes, and community sharing.",
  "frontend/src/pages/BioPage.tsx": "Displays an author bio page with background information, organization, social media links, and international experience sourced from proposalContent.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Shows a list of learning outcomes for the session, iterating over proposalContent.learningOutcomes in a styled layout.",
  "frontend/src/pages/OverviewPage.tsx": "Provides a landing overview with hero banner, abstract content, and quick links to activities and learning outcomes using proposalContent.",
  "frontend/src/pages/ReferencesPage.tsx": "Lists academic and research references supporting the session, rendered from proposalContent.references.",
  "frontend/src/pages/SessionOutlinePage.tsx": "File exists but currently contains no implementation or exported component.",
  "frontend/src/pages/SlidesPage.tsx": "File exists but currently contains no implementation or exported component.",
  "frontend/src/pages/TakeawaysPage.tsx": "Renders key takeaways for the session, displaying titled insights and descriptions from proposalContent.takeaways.",
  "frontend/src/utils/activity1Affirmations.ts": "Defines input types and a deterministic generator that creates leadership affirmation messages based on a chosen word, personal reflections, and action steps, using themed templates with academic citations.",
  "frontend/src/utils/activity2Validation.ts": "Generates a validation message and aligned academic citation for a user’s micro-solution by thematically matching input text against a reference list and selecting a deterministic citation.",
  "frontend/src/utils/challengeTypeMapping.ts": "Defines stable UI string keys for leadership challenge types and maps them to backend ChallengeType enum values for submission.",
  "frontend/src/utils/quoteFormatting.ts": "Formats backend QuoteGenre enum values into user-friendly franchise names for display in the UI.",
  "frontend/src/utils/starWarsQuotes.ts": "Provides a curated list of Star Wars quotes with attribution and a deterministic selector function based on a numeric seed.",
  "frontend/src/utils/userFacingError.ts": "Normalizes unknown or backend error values into clear, user-facing English messages covering initialization, validation, network, and generic failures.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, theme extensions (colors, fonts, animations), container settings, and integrated plugins.",
  "project_state.json": "Tracks project metadata and current feature inventory for the ICP-based React and Motoko web app, including authentication, content modules, activities, UI framework, and build scaffolding."
}