{
  "backend/main.mo": "Motoko canister handling user profiles, leadership word submissions with counting, and resilient leadership activity submissions with access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON list summarizing major frontend files, their purposes, and recent updates to content, routing, and activity behavior.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and applying global base styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining all app routes and wrapping them in the themed AppShell.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, navigation, Internet Identity auth controls, and mobile menu.",
  "frontend/src/components/LeadershipWordPatternsSummary.tsx": "Displays top submitted leadership words using a dynamic bar chart fed by backend counts.",
  "frontend/src/components/MicroSolutionsCommunityList.tsx": "Displays community micro‑solutions with loading, empty, and list states using data from useMicroSolutions.",
  "frontend/src/components/PageSection.tsx": "Provides a styled section wrapper component with configurable class names.",
  "frontend/src/components/SignInGate.tsx": "Shows a sign‑in prompt using Internet Identity when the user is not authenticated, otherwise renders children.",
  "frontend/src/content/proposalContent.ts": "Exports structured proposal content including metadata, bio, abstracts, and learning outcomes.",
  "frontend/src/content/references.ts": "Defines and exports a typed, ordered list of reference entries for use across the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and submitting leadership words, micro‑solutions, activity data, and quotes via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines extensive light/dark theme CSS variables for colors, borders, and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ActivitiesPage.tsx": "Displays two activity cards with titles, goals, descriptions, and links to their respective activity pages.",
  "frontend/src/pages/Activity1LeadershipWordPage.tsx": "Implements Activity 1 form flow for submitting a leadership word, generating an affirmation, and fetching a quote with validation and error handling.",
  "frontend/src/pages/Activity2ResilientLeadershipPage.tsx": "Implements Activity 2 form logic for submitting a resilience scenario, validating inputs, and retrieving a supporting quote.",
  "frontend/src/pages/BioPage.tsx": "Shows the author's bio, organization, international experience, and social profile links.",
  "frontend/src/pages/LearningOutcomesPage.tsx": "Lists session learning outcomes pulled from proposalContent with styled cards.",
  "frontend/src/pages/OverviewPage.tsx": "Renders the hero banner, abstract content, and links to activities and learning outcomes.",
  "frontend/src/pages/ReferencesPage.tsx": "Displays a styled list of reference entries from the REFERENCES dataset.",
  "frontend/src/pages/SessionOutlinePage.tsx": "Empty page placeholder for future session outline content.",
  "frontend/src/pages/SlidesPage.tsx": "Empty page placeholder intended for slide deck or presentation content.",
  "frontend/src/pages/TakeawaysPage.tsx": "Presents key takeaways with titles and descriptions sourced from proposalContent.",
  "frontend/src/utils/activity1Affirmations.ts": "Builds leadership affirmation messages using templates keyed by traits and user inputs with reference citations.",
  "frontend/src/utils/activity2Validation.ts": "Generates a citation and validation message for micro-solutions by matching themes to reference keys.",
  "frontend/src/utils/challengeTypeMapping.ts": "Maps stable UI challenge-type keys to backend enum variants.",
  "frontend/src/utils/quoteFormatting.ts": "Converts backend quote genre enums into readable franchise names.",
  "frontend/src/utils/starWarsQuotes.ts": "Provides a list of curated Star Wars quotes and a deterministic quote selector.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into concise user-friendly messages.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "JSON describing the project’s version, high‑level summary, and a list of existing features with IDs, descriptions, and versioning metadata. It captures both frontend and backend capabilities including routing, styling, authentication, access control, and admin bootstrap flows."
}