{
  "kind": "build_request",
  "title": "Add moat-and-trees footer graphic for bottom of tab pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate a new decorative footer background graphic, visually consistent with the existing castle hero banner style, featuring a water moat and trees, sized to work as a bottom-of-page strip on all tab pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you create a different graphic similar to The castle background behind the title (Heroes and Villains in Higher Education: Resilience and The Role of Next Generation Student Leaders)\nthat will fit for the bottom of the tab pages like water (a mote) and some trees or something"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/moat-trees-footer-banner.dim_1600x300.png.",
        "The graphic is purely visual (no embedded text) and reads well when cropped responsively across common screen widths.",
        "The graphic’s style matches the existing hero banner aesthetic (similar palette/illustration style to /assets/generated/institution-hero-banner.dim_1600x600.png)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Render the new moat-and-trees footer graphic as a full-width bottom-of-page visual element on all routed pages (the tab pages), positioned above the global footer so it appears at the bottom of each page’s content area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "that will fit for the bottom of the tab pages like water (a mote) and some trees or something"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to each route (e.g., Overview, Bio, Learning Outcomes, Takeaways, Activities, Slides, References, Movie References, Leadership Board) displays the moat/trees image as a bottom strip above the existing footer.",
        "The image does not overlap page content and remains responsive (full width, fixed height or max-height, with appropriate object-fit).",
        "No backend changes are required for this feature."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose existing components instead).",
    "Do not route generated images through the backend; serve them as static assets from frontend/public/assets/generated."
  ],
  "nonGoals": [
    "Changing the existing hero banner image (/assets/generated/institution-hero-banner.dim_1600x600.png).",
    "Adding new navigation tabs or changing the routing structure.",
    "Adding any new backend endpoints or data models."
  ],
  "imageRequirements": {
    "required": [
      "Castle-style moat and trees footer banner illustration (moat-trees-footer-banner.dim_1600x300.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}