{
  "kind": "build_request",
  "title": "Block Villainous (negative) validations with error code 000; add Leadership Board tab with 2-column feedback",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update Activity 2 validation so that only the Heroic response can be validated. When the user triggers validation (\"Validate My Micro-Solution\" / generate another), do not use the Villain response to produce any validation output.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "only validate Heroic responses"
        ]
      },
      "acceptanceCriteria": [
        "In Activity 2, the generated validation message/citation is derived only from the Heroic response (and other non-villain fields as needed), and never from the Villain response text.",
        "The UI still allows entering a Villain response as part of the submission form, but it is not used in the validation/feedback generation step."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In both activities, block validation/feedback generation when the user input is Villainous/negative and show an error that includes error code \"000\". Do not produce an affirmation/validation result in this case.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "in the both activities do not validate Villainous reponses ( any negative answers ) give an error code of 000 any negative answers",
          "only validate Heroic responses"
        ]
      },
      "acceptanceCriteria": [
        "Activity 1: When the user requests feedback generation (affirmation), if the input is determined to be Villainous/negative, the UI shows an error containing \"000\" and does not display an affirmation result.",
        "Activity 2: When the user requests validation (or generate another), if the input is determined to be Villainous/negative, the UI shows an error containing \"000\" and does not display a validation result.",
        "The error message is user-facing English text and clearly states that only Heroic responses can be validated, including the literal code \"000\"."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a new navigation tab labeled \"Leadership Board\" that routes to a new page showing community feedback in a 2-column layout: Column 1 \"Leadership Words\" and Column 2 \"Community Solutions\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "create a tab titled Leadership Board and use 2 columns",
          "one column to be leadership words",
          "two column community solutions",
          "and list the feed back in the tab"
        ]
      },
      "acceptanceCriteria": [
        "A new \"Leadership Board\" link appears in the main navigation (desktop and mobile) alongside the existing nav items.",
        "Navigating to the Leadership Board page shows two visible columns on desktop (stacking responsibly on small screens) with headings exactly \"Leadership Words\" and \"Community Solutions\".",
        "The \"Leadership Words\" column renders the existing leadership word community feedback (using the existing leadership words summary / counts UI).",
        "The \"Community Solutions\" column renders the existing community micro-solution feedback list (using the existing micro-solutions list UI)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce migration.mo if persisted state schema changes (not required for purely UI/validation-logic changes).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or non-IC backend services.",
    "Implementing real-time updates (e.g., WebSockets) for the Leadership Board."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}