{
  "kind": "build_request",
  "title": "Activity 1 (Your Leadership Word) copy and button label updates",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update Activity 1 (Your Leadership Word) example words list to exactly: ethical, visionary, authentic, resilient, empathetic, principled, transformational, courageous, accountable, inclusive, decisive, adaptable, humble, inspiring, grounded.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "update examples to \nethical\nvisionary\nauthentic\nresilient\nempathetic\nprincipled\ntransformational\ncourageous\naccountable\ninclusive\ndecisive\nadaptable\nhumble\ninspiring\ngrounded"
        ]
      },
      "acceptanceCriteria": [
        "On the Activity 1 page, the 'Examples:' line displays the updated list in the same order provided by the user.",
        "The examples content is sourced consistently from the Activity 1 content (proposalContent.activities.activity1.examples) so it is not duplicated in multiple places."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Activity 1 (Your Leadership Word) page, add the following anonymous-information notice as user-facing text: \"Your information is anonymous the only information we see is what is on the top leadership word community patterns board\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "and add \n\nYour information is anonymous the only information we see is what is on the top leadership word community patterns board"
        ]
      },
      "acceptanceCriteria": [
        "The anonymous-information notice appears on Activity 1 in a readable location near the community patterns context (e.g., near the prompt area and/or near the community patterns board section).",
        "The notice text matches exactly (including capitalization) as provided by the user."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Activity 1 submit button label from \"Share Your Leadership Word\" to exactly \"Share Your leadership word For Feedback\" (when not in the submitting/loading state).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "update Share Your leadership word button to say  Share Your leadership word For Feedback"
        ]
      },
      "acceptanceCriteria": [
        "When the submit button is enabled and not submitting, its label reads exactly: \"Share Your leadership word For Feedback\".",
        "When submitting, the loading label \"Submitting...\" remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not change backend data models, storage, or submission behavior for Activity 1.",
    "Do not change Activity 2 content or UI.",
    "Do not change the post-submission thank-you screen text unless required by the three requested changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}