{
  "kind": "build_request",
  "title": "Update Bio tab International Experience section title and locations",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Bio tab (Bio page), update the section currently titled \"International Experience\" to be titled \"International Educational Experience\" and replace the existing descriptive paragraph with a clearly formatted list containing exactly these locations (one per line/bullet): Berlin, Germany; Zurich, Switzerland; Milan, Italy; London, England; Johannesburg, South Africa; Antigua, Guatemala.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In the bio tab \nInternational Experience\nUpdate the title to say International Educational Experience\nAnd list these locations \nBerlin, Germany \nZurich, Switzerland \nMilan, Italy\nLondon, England\nJohannesburg, South Africa \nAntigua, Guatemala"
        ]
      },
      "acceptanceCriteria": [
        "On the Bio page, the section header text reads exactly \"International Educational Experience\" (replacing \"International Experience\").",
        "The paragraph under that header is removed/replaced with a list (e.g., <ul>/<li>) showing exactly 6 entries in this order: 1) Berlin, Germany 2) Zurich, Switzerland 3) Milan, Italy 4) London, England 5) Johannesburg, South Africa 6) Antigua, Guatemala.",
        "No other content on the Bio page is changed (name, links, and other sections remain as-is)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new navigation items or new tabs.",
    "Changing backend data models or storing these locations in the backend (keep as static Bio page content)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}