{
  "kind": "build_request",
  "title": "Replace References page list and align Activity 1 & 2 citations to the updated references",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fully replace the References page content so it displays the updated reference list exactly as shown in the uploaded image, preserving the same order and formatting (including punctuation, diacritics, bracketed notes, and URLs). Update the source of truth for the References page to match this list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-13"
        ],
        "quotes": [
          "Fully replace the reference page. Have them in the same order and formatting."
        ]
      },
      "acceptanceCriteria": [
        "The References page renders 18 references in the same order as the uploaded image.",
        "The list includes the Fernweh Motive (n.d.) Vestrahorn Island entry and keeps Wang et al. (2025) as the final entry, matching the uploaded image.",
        "Reference strings match the uploaded image text (including special characters like “Bieńkowska”, brackets, and full URLs)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update Activity 2’s generated validation citation selection so it continues to return citations from the updated References list after the replacement, without relying on hard-coded numeric indices that would break when reference ordering changes. The citation returned to the UI must be drawn from the same updated reference list used by the References page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "update the activity one and two messages with the updated reference page."
        ]
      },
      "acceptanceCriteria": [
        "Activity 2 validation always displays an 'ALIGNED RESEARCH CITATION' that is one of the entries shown on the References page.",
        "Re-ordering the references array (as required by the uploaded image) does not cause out-of-range access or mismatched citations in Activity 2."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update Activity 1’s generated affirmation messaging so any in-text citations it uses are consistent with (and present in) the updated References list, ensuring Activity 1 messaging remains aligned with the updated References page after the replacement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "update the activity one and two messages with the updated reference page."
        ]
      },
      "acceptanceCriteria": [
        "Activity 1 affirmation text does not cite works that are absent from the updated References page list.",
        "After the References list replacement, Activity 1 continues to generate affirmations without errors and with citations aligned to the updated reference list."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (as specified in SYSTEM_CONTEXT).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not introduce new activities or new content pages beyond updating references and citation alignment.",
    "Do not change backend canister APIs or persistence for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}