{
  "kind": "build_request",
  "title": "Allow anonymous Activity 1 & 2 submissions without waiting for Internet Identity",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update Activity 1 and Activity 2 pages so users can fill out and submit the forms without being blocked by Internet Identity authentication or identity-loading state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "adjust the code so that anonymous users can submit without requiring the identity to finish loading."
        ]
      },
      "acceptanceCriteria": [
        "When not signed in (anonymous), the Activity 1 form is visible and the Submit button can be used successfully.",
        "When not signed in (anonymous), the Activity 2 form is visible and the Submit button can be used successfully.",
        "The UI no longer shows a blocking “Connecting… Please wait while we establish a secure connection.” gate that prevents anonymous submissions on Activities 1 & 2."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Refactor the use of the SignInGate component on Activities 1 & 2 so that it does not gate the submission forms; if any content still requires authentication (e.g., viewing community contributions), gate only that specific content and keep submission accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "anonymous users can submit without requiring the identity to finish loading."
        ]
      },
      "acceptanceCriteria": [
        "Activity 1 page does not wrap the submission form in SignInGate.",
        "Activity 2 page does not wrap the submission form in SignInGate.",
        "If community sections remain gated, they display a sign-in prompt while the submission form remains usable."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust frontend submit/quote actions on Activity 1 and Activity 2 to rely on the anonymous actor when the authenticated identity is unavailable, rather than blocking based on identity-loading state (e.g., do not treat Internet Identity initialization as a hard prerequisite for submission).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "submit without requiring the identity to finish loading."
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load where Internet Identity never completes, users can still submit Activity 1 and Activity 2 responses.",
        "Submission errors (if any) are real backend errors, not a generic 'Connection is still initializing' message solely caused by identity loading."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update backend access control logic so anonymous principals are allowed to submit Activity 1 and Activity 2 responses (and can retrieve Activity 1/2 quotes if those are used immediately after anonymous submission).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "anonymous users can submit without requiring the identity to finish loading."
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo accepts calls from anonymous principals for submitLeadershipWord without trapping as unauthorized.",
        "backend/main.mo accepts calls from anonymous principals for submitResilientLeadershipActivity without trapping as unauthorized.",
        "If Activity pages fetch quotes after submission, backend/main.mo allows anonymous principals to call getNextActivity1Quote and getNextActivity2Quote (or the frontend avoids calling these endpoints anonymously)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or other paths listed in frontend.immutablePaths.",
    "Keep all Motoko logic in the single actor at backend/main.mo; add backend/migration.mo only if a state upgrade is required."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding new real-time communication features (e.g., WebSockets).",
    "Changing unrelated pages or redesigning the overall navigation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}