{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Activity 1 copy updates (examples list, anonymity notice, submit button label)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update Activity 1 example words list in proposal content to the exact provided sequence and keep the Activity 1 page sourcing it from proposalContent.",
      "acceptanceCriteria": [
        "On the Activity 1 page, the 'Examples:' line displays the updated list in the same order provided by the user.",
        "The examples content is sourced consistently from the Activity 1 content (proposalContent.activities.activity1.examples) so it is not duplicated in multiple places."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/proposalContent.ts",
          "operation": "modify",
          "description": "Replace proposalContent.activities.activity1.examples with exactly: \"ethical, visionary, authentic, resilient, empathetic, principled, transformational, courageous, accountable, inclusive, decisive, adaptable, humble, inspiring, grounded.\" (including punctuation and order)."
        },
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Ensure the Activity 1 page continues to render the examples line directly from proposalContent.activities.activity1.examples (no hardcoded/duplicated examples elsewhere)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add the exact anonymous-information notice text to the Activity 1 page near the community patterns context.",
      "acceptanceCriteria": [
        "The anonymous-information notice appears on Activity 1 in a readable location near the community patterns context (e.g., near the prompt area and/or near the community patterns board section).",
        "The notice text matches exactly (including capitalization) as provided by the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Add the user-facing notice text exactly as: \"Your information is anonymous the only information we see is what is on the top leadership word community patterns board\" and place it in a readable location near the community patterns section (e.g., above the LeadershipWordPatternsSummary section and/or near the prompt area)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the Activity 1 submit button label to the exact requested text when not submitting, keeping the submitting label unchanged.",
      "acceptanceCriteria": [
        "When the submit button is enabled and not submitting, its label reads exactly: \"Share Your leadership word For Feedback\".",
        "When submitting, the loading label \"Submitting...\" remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Change the non-loading submit button label from \"Share Your Leadership Word\" to exactly \"Share Your leadership word For Feedback\" while leaving the pending state label \"Submitting...\" unchanged."
        }
      ]
    }
  ]
}