{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update References list and align Activity 1 & 2 citations to the new source of truth",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the References page source-of-truth and rendered content to match the 18-item reference list exactly (order and text) from the uploaded image.",
      "acceptanceCriteria": [
        "The References page renders 18 references in the same order as the uploaded image.",
        "The list includes the Fernweh Motive (n.d.) Vestrahorn Island entry and keeps Wang et al. (2025) as the final entry, matching the uploaded image.",
        "Reference strings match the uploaded image text (including special characters like “Bieńkowska”, brackets, and full URLs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/references.ts",
          "operation": "create",
          "description": "Create a dedicated References source-of-truth module exporting the updated 18-reference list exactly as shown in the uploaded image (same order and exact text), and (optionally) stable reference keys for reuse across Activity utilities."
        },
        {
          "path": "frontend/src/content/proposalContent.ts",
          "operation": "modify",
          "description": "Update proposalContent so its references field is sourced from the new frontend/src/content/references.ts list (ensuring a single source of truth that matches the uploaded image exactly)."
        },
        {
          "path": "frontend/src/pages/ReferencesPage.tsx",
          "operation": "modify",
          "description": "Update the References page to render the updated references list from the new source-of-truth (frontend/src/content/references.ts) and adjust rendering so the displayed list preserves the intended list formatting (order, punctuation, diacritics, bracketed notes, and URLs) without introducing additional reformatting."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refactor Activity 2 validation citation selection to select citations from the updated References source-of-truth without hard-coded numeric indices.",
      "acceptanceCriteria": [
        "Activity 2 validation always displays an 'ALIGNED RESEARCH CITATION' that is one of the entries shown on the References page.",
        "Re-ordering the references array (as required by the uploaded image) does not cause out-of-range access or mismatched citations in Activity 2."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/activity2Validation.ts",
          "operation": "modify",
          "description": "Replace index-based citation selection with a stable-key or lookup-based approach that pulls the final citation string from the same updated reference list used by the References page (importing from frontend/src/content/references.ts), ensuring no out-of-range access and that the returned citation is always one of the displayed references."
        },
        {
          "path": "frontend/src/content/references.ts",
          "operation": "modify",
          "description": "Add/maintain stable reference keys (or an equivalent lookup helper) that Activity 2 can use for deterministic selection without numeric indices, while keeping the exported ordered 18-item reference list exactly matching the uploaded image."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure Activity 1 affirmation messaging citations remain consistent with and present in the updated References list.",
      "acceptanceCriteria": [
        "Activity 1 affirmation text does not cite works that are absent from the updated References page list.",
        "After the References list replacement, Activity 1 continues to generate affirmations without errors and with citations aligned to the updated reference list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/activity1Affirmations.ts",
          "operation": "modify",
          "description": "Review and update Activity 1 affirmation templates so all in-text citations correspond to works present in the updated References source-of-truth (frontend/src/content/references.ts). If needed, switch any citation references to use the same stable reference identifiers used elsewhere to prevent drift after future list edits."
        },
        {
          "path": "frontend/src/content/references.ts",
          "operation": "modify",
          "description": "If Activity 1 adopts stable reference identifiers, ensure the reference key catalog supports all works cited by Activity 1 affirmations while keeping the ordered 18-item reference list unchanged and exactly matching the uploaded image."
        }
      ]
    }
  ]
}