{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Heroic-only validation, villainous input blocking (000), and Leadership Board page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Activity 2 validation/citation generation never uses Villain response text and is derived only from Heroic and other non-villain fields.",
      "acceptanceCriteria": [
        "In Activity 2, the generated validation message/citation is derived only from the Heroic response (and other non-villain fields as needed), and never from the Villain response text.",
        "The UI still allows entering a Villain response as part of the submission form, but it is not used in the validation/feedback generation step."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/activity2Validation.ts",
          "operation": "modify",
          "description": "Remove any Villain-response-bearing fields from the Activity 2 validation input type and ensure theme matching/citation selection and message generation only consider Heroic + allowed non-villain fields (e.g., microSolution, protectiveFactor, heroicResponse)."
        },
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Adjust the call site so the object passed into generateActivity2Validation excludes villainResponse (pass only the allowed non-villain fields), ensuring validation output cannot be influenced by the Villain text."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Block feedback/validation generation in Activities 1 and 2 when the relevant user input is villainous/negative; show a user-facing error containing code \"000\" and do not display results.",
      "acceptanceCriteria": [
        "Activity 1: When the user requests feedback generation (affirmation), if the input is determined to be Villainous/negative, the UI shows an error containing \"000\" and does not display an affirmation result.",
        "Activity 2: When the user requests validation (or generate another), if the input is determined to be Villainous/negative, the UI shows an error containing \"000\" and does not display a validation result.",
        "The error message is user-facing English text and clearly states that only Heroic responses can be validated, including the literal code \"000\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/isVillainousInput.ts",
          "operation": "create",
          "description": "Add a small shared utility that classifies a string (or combined strings) as villainous/negative using a conservative heuristic (keyword/phrase matching + basic normalization) suitable for client-side blocking before generating affirmations/validations."
        },
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Before generating an affirmation (\"Get Your Affirmation\" and \"Generate Another\"), evaluate the relevant user inputs with isVillainousInput; if villainous/negative, show a user-facing error that includes code \"000\" (e.g., \"Error 000: Only Heroic responses can be validated...\") and do not set/render affirmationResult."
        },
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Before generating validation (\"Validate My Micro-Solution\" and \"Generate Another\"), evaluate the relevant user inputs (heroicResponse and any other non-villain fields used for validation) with isVillainousInput; if villainous/negative, show a user-facing error that includes code \"000\" and do not set/render validationResult."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a new \"Leadership Board\" navigation tab and page that renders community feedback in a responsive 2-column layout.",
      "acceptanceCriteria": [
        "A new \"Leadership Board\" link appears in the main navigation (desktop and mobile) alongside the existing nav items.",
        "Navigating to the Leadership Board page shows two visible columns on desktop (stacking responsibly on small screens) with headings exactly \"Leadership Words\" and \"Community Solutions\".",
        "The \"Leadership Words\" column renders the existing leadership word community feedback (using the existing leadership words summary / counts UI).",
        "The \"Community Solutions\" column renders the existing community micro-solution feedback list (using the existing micro-solutions list UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LeadershipBoardPage.tsx",
          "operation": "create",
          "description": "Create the Leadership Board page using the existing PageSection layout, and render a responsive two-column grid with headings exactly \"Leadership Words\" and \"Community Solutions\", using the existing LeadershipWordPatternsSummary and MicroSolutionsCommunityList components."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route (e.g., /leadership-board) wired to LeadershipBoardPage so the new tab navigates to the new page."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Add a new navLinks item labeled \"Leadership Board\" so it appears in both desktop navigation and the mobile menu alongside existing items."
        }
      ]
    }
  ]
}