{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable anonymous submissions for Activities 1 & 2 without Internet Identity gating",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Activity 1 & 2 forms visible and submittable even when Internet Identity is not signed in or still loading.",
      "acceptanceCriteria": [
        "When not signed in (anonymous), the Activity 1 form is visible and the Submit button can be used successfully.",
        "When not signed in (anonymous), the Activity 2 form is visible and the Submit button can be used successfully.",
        "The UI no longer shows a blocking “Connecting… Please wait while we establish a secure connection.” gate that prevents anonymous submissions on Activities 1 & 2."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Remove the blocking identity/actor-loading UI gate around the Activity 1 submission form and ensure the form renders for anonymous users; keep only minimal non-blocking feedback (e.g., disable submit only while the submit mutation is pending or while no actor is available yet)."
        },
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Remove the blocking identity/actor-loading UI gate around the Activity 2 submission form and ensure the form renders for anonymous users; keep only minimal non-blocking feedback (e.g., disable submit only while the submit mutation is pending or while no actor is available yet)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Refactor SignInGate usage so it gates only authenticated-only sections (e.g., community contributions) and not the submission forms on Activities 1 & 2.",
      "acceptanceCriteria": [
        "Activity 1 page does not wrap the submission form in SignInGate.",
        "Activity 2 page does not wrap the submission form in SignInGate.",
        "If community sections remain gated, they display a sign-in prompt while the submission form remains usable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Stop wrapping the Activity 1 submission form in SignInGate; if community-facing content remains on this page (e.g., LeadershipWordPatternsSummary after submission), wrap only that specific community section in SignInGate while keeping the submission flow accessible."
        },
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Stop wrapping the Activity 2 submission form in SignInGate; if community-facing content remains on this page (e.g., MicroSolutionsCommunityList after submission), wrap only that specific community section in SignInGate while keeping the submission flow accessible."
        },
        {
          "path": "frontend/src/components/SignInGate.tsx",
          "operation": "modify",
          "description": "Adjust SignInGate messaging so it no longer claims sign-in is required to submit responses (since Activities 1 & 2 allow anonymous submission); keep the prompt oriented toward gated content like viewing community contributions, and ensure behavior remains a simple render-block for only the wrapped section."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure submit/quote actions on Activities 1 & 2 use an anonymous actor when authenticated identity is unavailable, instead of blocking on identity-loading state.",
      "acceptanceCriteria": [
        "On a fresh load where Internet Identity never completes, users can still submit Activity 1 and Activity 2 responses.",
        "Submission errors (if any) are real backend errors, not a generic 'Connection is still initializing' message solely caused by identity loading."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor Activity 1/2 submit and quote mutations to be resilient to actor unavailability by falling back to creating/using an anonymous actor when the authenticated actor is not yet available; avoid throwing/returning generic initialization errors solely due to identity loading."
        },
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Update Activity 1 submit and quote-fetch handlers to no longer block based on isActorFetching; rely on the refactored mutations that can operate with an anonymous actor, and ensure any user-visible errors come from actual failures (using toUserFacingError)."
        },
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Update Activity 2 submit and quote-fetch handlers to no longer block based on isActorFetching; rely on the refactored mutations that can operate with an anonymous actor, and ensure any user-visible errors come from actual failures (using toUserFacingError)."
        }
      ]
    }
  ]
}