{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Moat-and-trees footer banner asset and page-bottom rendering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new castle-style decorative moat-and-trees footer banner graphic as a generated static asset sized for a bottom-of-page strip.",
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/moat-trees-footer-banner.dim_1600x300.png.",
        "The graphic is purely visual (no embedded text) and reads well when cropped responsively across common screen widths.",
        "The graphic’s style matches the existing hero banner aesthetic (similar palette/illustration style to /assets/generated/institution-hero-banner.dim_1600x600.png)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/moat-trees-footer-banner.dim_1600x300.png",
          "operation": "create",
          "description": "Create the new decorative footer strip illustration (moat + trees), visually consistent with the existing castle hero banner style; ensure it is text-free and designed to crop well horizontally at common viewport widths."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render the moat-and-trees footer banner as a full-width bottom-of-page strip on all routed pages, positioned above the global footer and responsive without overlapping content.",
      "acceptanceCriteria": [
        "Navigating to each route (e.g., Overview, Bio, Learning Outcomes, Takeaways, Activities, Slides, References, Movie References, Leadership Board) displays the moat/trees image as a bottom strip above the existing footer.",
        "The image does not overlap page content and remains responsive (full width, fixed height or max-height, with appropriate object-fit).",
        "No backend changes are required for this feature."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Insert a full-width decorative image strip immediately above the existing global <footer>, using the static asset frontend/public/assets/generated/moat-trees-footer-banner.dim_1600x300.png; ensure layout keeps it at the bottom of each page’s content area (within the flex column shell), with responsive sizing (fixed height or max-height) and object-fit so it does not overlap the routed page content."
        }
      ]
    }
  ]
}