{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Activity 1 & 2 canister-provided per-user quote cycling (frontend integration)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update Activity 1 to display the canister-provided next quote (per-user Activity 1 pool) instead of the deterministic Star Wars-only selector.",
      "acceptanceCriteria": [
        "After a successful Activity 1 submission, when the user clicks the affirmation/feedback button, the displayed quote comes from the backend and is tied to the signed-in user’s Activity 1 quote cycle.",
        "Reloading the page and requesting another quote continues the same user’s sequence (no repetition until exhaustion).",
        "User-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity1LeadershipWordPage.tsx",
          "operation": "modify",
          "description": "Replace the deterministic Star Wars quote selection with a call to a new React Query mutation hook that retrieves the next Activity 1 quote from the authenticated backend actor; render the returned quote with attribution and a franchise label derived from the backend quote genre; add loading/error handling in English and remove unused deterministic quote state."
        },
        {
          "path": "frontend/src/utils/starWarsQuotes.ts",
          "operation": "modify",
          "description": "Stop using this module for Activity 1 feedback quotes by removing or deprecating the Activity 1 call sites; keep the module available only if still required elsewhere (verify no remaining imports are needed after Activity 1 and 2 updates)."
        },
        {
          "path": "frontend/src/utils/quoteFormatting.ts",
          "operation": "create",
          "description": "Add a small frontend utility to map backend Quote.genre (e.g., starWars/batman/harryPotter/avengers) into a user-facing English franchise label string suitable for displaying alongside quote attribution."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update Activity 2 to fetch and display canister-provided quotes for both “Validate My Micro-Solution” and “Generate Another”, while preserving the existing citation and validation message behavior.",
      "acceptanceCriteria": [
        "Clicking “Validate My Micro-Solution” fetches and displays a canister-provided quote from the Activity 2 pool for the signed-in user.",
        "Clicking “Generate Another” fetches the next canister-provided quote for the signed-in user (no local deterministic reseeding for quotes).",
        "The displayed citation and validation message still render correctly and in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Activity2ResilientLeadershipPage.tsx",
          "operation": "modify",
          "description": "Replace deterministic quote reseeding with calls to a new React Query mutation hook that fetches the next Activity 2 quote from the authenticated backend actor for both Validate and Generate Another; keep citation/message generation intact by computing them independently from the quote; add loading/error handling in English and remove the local quote seed state used only for deterministic quote selection."
        },
        {
          "path": "frontend/src/utils/activity2Validation.ts",
          "operation": "modify",
          "description": "Refactor validation generation so the citation selection and English validation message can be produced without choosing a deterministic local quote (e.g., export a helper that returns {citation, message} given the lastSubmission inputs, and allow the page to combine that with the canister-provided quote)."
        },
        {
          "path": "frontend/src/utils/quoteFormatting.ts",
          "operation": "modify",
          "description": "Extend the franchise label mapping utility (created for Activity 1) to support Activity 2 display formatting as well, ensuring the UI shows an English franchise label derived from backend Quote.genre."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add React Query mutations/hooks for next-quote retrieval and ensure correct behavior when identity changes using existing useActor + React Query patterns.",
      "acceptanceCriteria": [
        "Quote-fetching uses the authenticated actor (Internet Identity) and fails gracefully with English error messaging when the actor is not ready.",
        "Switching identities results in an independent quote cycle per Principal (a different user does not inherit another user’s cursor)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutations/hooks for fetching the next Activity 1 quote and next Activity 2 quote using the backend actor methods (getNextActivity1Quote/getNextActivity2Quote); ensure the hooks guard against actor-not-ready with clear English errors (integrating with existing error handling patterns) and use stable query keys that naturally separate by identity via the existing actor invalidation behavior."
        },
        {
          "path": "frontend/src/utils/userFacingError.ts",
          "operation": "modify",
          "description": "Ensure quote-fetch related failures (e.g., actor not initialized/connection still initializing, or unexpected backend failures) normalize into clear English user-facing messages consistent with existing patterns."
        }
      ]
    }
  ]
}